In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame

In [5]:
dframe1 =DataFrame({"key":["x","z","y","z","x","x"],"dataset1":np.arange(6)})

In [6]:
dframe1

  key  dataset1
0   x         0
1   z         1
2   y         2
3   z         3
4   x         4
5   x         5

In [7]:
dframe2 =DataFrame({"key":["q","y","z"],"dataset2":[1,2,3]})

In [8]:
dframe2

  key  dataset2
0   q         1
1   y         2
2   z         3

In [9]:
pd.merge(dframe1,dframe2)

  key  dataset1  dataset2
0   z         1         3
1   z         3         3
2   y         2         2

In [13]:
pd.merge(dframe1,dframe2,on="key")

  key  dataset1  dataset2
0   z         1         3
1   z         3         3
2   y         2         2

In [15]:
pd.merge(dframe1,dframe2,on="key",how="left")

  key  dataset1  dataset2
0   x         0       NaN
1   z         1       3.0
2   y         2       2.0
3   z         3       3.0
4   x         4       NaN
5   x         5       NaN

In [2]:
dfram3 =pd.DataFrame({'key': ['X', 'X', 'X', 'Y', 'Z', 'Z'],
                 'data_set_3': range(6)})
# dframe3 = DataFrame({'key': ['X', 'X', 'X', 'Y', 'Z', 'Z'],
#                  'data_set_3': range(6)})

In [3]:
dframe4 = DataFrame({'key': ['Y', 'Y', 'X', 'X', 'Z'],
                 'data_set_4': range(5)})

In [4]:
dfram3
dframe4

  key  data_set_4
0   Y           0
1   Y           1
2   X           2
3   X           3
4   Z           4

In [5]:
dfram3

  key  data_set_3
0   X           0
1   X           1
2   X           2
3   Y           3
4   Z           4
5   Z           5

In [6]:
pd.merge(dfram3,dframe4)

  key  data_set_3  data_set_4
0   X           0           2
1   X           0           3
2   X           1           2
3   X           1           3
4   X           2           2
5   X           2           3
6   Y           3           0
7   Y           3           1
8   Z           4           4
9   Z           5           4

In [7]:
df_left = DataFrame({'key1': ['SF', 'SF', 'LA'],
                  'key2': ['one', 'two', 'one'],
                  'left_data': [10,20,30]})
df_right = DataFrame({'key1': ['SF', 'SF', 'LA', 'LA'],
                   'key2': ['one', 'one', 'one', 'two'],
                   'right_data': [40,50,60,70]})

In [8]:
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [9]:
df_right

  key1 key2  right_data
0   SF  one          40
1   SF  one          50
2   LA  one          60
3   LA  two          70

In [19]:
pd.merge(df_left, df_right, on=['key1', 'key2'], how='outer')

  key1 key2  left_data  right_data
0   SF  one       10.0        40.0
1   SF  one       10.0        50.0
2   SF  two       20.0         NaN
3   LA  one       30.0        60.0
4   LA  two        NaN        70.0

In [17]:
pd.merge(df_left, df_right, on=['key1', 'key2'], how='outer')

  key1 key2  left_data  right_data
0   SF  one       10.0        40.0
1   SF  one       10.0        50.0
2   SF  two       20.0         NaN
3   LA  one       30.0        60.0
4   LA  two        NaN        70.0

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [6]:
dframe= DataFrame({"k1":["X","X","Y","Y","Z"],"k2":["alpha","beta","alpha","beta","alpha"],"dataset":np.random.randn(5),"dataset2":np.random.randn(5)})

In [7]:
dframe

  k1     k2   dataset  dataset2
0  X  alpha -0.585127 -0.485643
1  X   beta  1.427884  0.292896
2  Y  alpha -0.160945 -0.648434
3  Y   beta -1.563018 -0.091354
4  Z  alpha  1.831047 -1.040613

In [11]:
group =dframe["dataset"].groupby(dframe["k1"])

                                                #k1でまとまってるもの

In [9]:
group

In [10]:
group.mean()

k1
X    0.421379
Y   -0.861981
Z    1.831047
Name: dataset, dtype: float64

In [12]:
citis =np.array(["NY","LA","LA","NY","NY"])

In [13]:
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [14]:
dframe.groupby("k1").mean()

     dataset  dataset2
k1
X   0.421379 -0.096374
Y  -0.861981 -0.369894
Z   1.831047 -1.040613

In [15]:
dframe

  k1     k2   dataset  dataset2
0  X  alpha -0.585127 -0.485643
1  X   beta  1.427884  0.292896
2  Y  alpha -0.160945 -0.648434
3  Y   beta -1.563018 -0.091354
4  Z  alpha  1.831047 -1.040613

In [16]:
dframe["citis"] =np.array(["NY","LA","LA","NY","NY"])

In [17]:
dframe["month"] =month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [20]:
dframe

  k1     k2   dataset  dataset2 citis month
0  X  alpha -0.585127 -0.485643    NY   JAN
1  X   beta  1.427884  0.292896    LA   FEB
2  Y  alpha -0.160945 -0.648434    LA   JAN
3  Y   beta -1.563018 -0.091354    NY   FEB
4  Z  alpha  1.831047 -1.040613    NY   JAN

In [23]:
dframe.groupby("citis").mean()

        dataset  dataset2
citis
LA     0.633470 -0.177769
NY    -0.105699 -0.539204

In [26]:
dframe.groupby("k1").describe()

   dataset                                                    ...  dataset2
     count      mean       std       min       25%       50%  ...       std       min       25%       50%       75%       max
k1                                                            ...
X      2.0  0.421379  1.423414 -0.585127 -0.081874  0.421379  ...  0.550510 -0.485643 -0.291008 -0.096374  0.098261  0.292896
Y      2.0 -0.861981  0.991415 -1.563018 -1.212500 -0.861981  ...  0.393915 -0.648434 -0.509164 -0.369894 -0.230624 -0.091354
Z      1.0  1.831047       NaN  1.831047  1.831047  1.831047  ...       NaN -1.040613 -1.040613 -1.040613 -1.040613 -1.040613

[3 rows x 16 columns]

In [27]:
import numpy as np

In [34]:
import pandas as pd
from pandas import Series, DataFrame

In [35]:
animals = DataFrame(np.arange(16).reshape(4, 4),
                   columns=['W', 'X', 'Y', 'Z'],
                   index=['Dog', 'Cat', 'Bird', 'Mouse'])

In [36]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [38]:
# animals.ix[1:2,["W","X "]] =np.nan
animals[1:2, ['W', 'Y']] = np.nan

TypeError: unhashable type: 'slice'

In [54]:
animals.loc[:,"y"].drop()

ValueError: Need to specify at least one of 'labels', 'index' or 'columns'

In [53]:
animals

          W   X     Y   Z   y
Dog     0.0   1   2.0   3 NaN
Cat     NaN   5   NaN   7 NaN
Bird    8.0   9  10.0  11 NaN
Mouse  12.0  13  14.0  15 NaN

In [60]:
animals= animals.drop("y", axis=1)
# print(df.drop('Charlie', axis=0))

In [61]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [62]:
behavior_map = {'W': 'bad', 'X': 'good', 'Y': 'bad','Z': 'good'}

In [63]:
animals_col =animals.groupby(behavior_map,axis=1)

In [65]:
animals_col.mean()

        bad  good
Dog     1.0   2.0
Cat     NaN   6.0
Bird    9.0  10.0
Mouse  13.0  14.0

In [67]:
behavior_series =Series(behavior_map)

In [68]:
behavior_series

W     bad
X    good
Y     bad
Z    good
dtype: object

In [70]:
animals.groupby(behavior_series,axis=1).count()

       bad  good
Dog      2     2
Cat      0     2
Bird     2     2
Mouse    2     2

In [73]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15